ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияУровняШума/лис_ЖурналОпределенияУровняШума.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ЖурналОпределенияУровняШума</name>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.лис_КомпонентыЗамеровЛаборатории</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <resources>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </resources>
  <resources>
    <name>СодержаниеПоРасчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭквивалентныйУровеньЗвука1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭквивалентныйУровеньЗвука2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭквивалентныйУровеньЗвука3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭквивалентныйУровеньЗвука4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийУровеньЗвукаЭквивалентный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширеннаяНеопределенностьЭквивалентный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйУровеньЗвука1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйУровеньЗвука2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйУровеньЗвука3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйУровеньЗвука4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийУровеньЗвукаМаксимальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширеннаяНеопределенностьМаксимальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.лис_ЖурналОпределенияУровняШума</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктОтбора</name>
    <type>
      <types>DocumentRef.лис_АктОтбораПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияУровняШума/Forms/ФормаЗаписи/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РасчитатьСреднееЭквивалентноеЗначение()
	
	Запись.СреднийУровеньЗвукаЭквивалентный = (Запись.ЭквивалентныйУровеньЗвука1 + Запись.ЭквивалентныйУровеньЗвука2 
		+ Запись.ЭквивалентныйУровеньЗвука3 + Запись.ЭквивалентныйУровеньЗвука4) / 4;
	
КонецФункции

&НаКлиенте
Функция РасчитатьСреднееМаксимальноеЗначение()
	
	Запись.СреднийУровеньЗвукаМаксимальный = (Запись.МаксимальныйУровеньЗвука1 + Запись.МаксимальныйУровеньЗвука2 
		+ Запись.МаксимальныйУровеньЗвука3 + Запись.МаксимальныйУровеньЗвука4) / 4;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	

КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука1ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука2ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука3ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука4ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука1ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука2ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука3ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука4ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры



#КонецОбласти
